argandas/STM32F746G-DISCO_TouchGFX_Demo-1/Core/Src/main.cpp
    if ((xStatusHTTP != pdTRUE) || (req_ptr->builder_state != LwHHTP_BUILDER_FINISHED))
    {
      DBG_LWIP("HTTP Request Build Failed! (status = %d, state = %d)\r\n", xStatusHTTP, req_ptr->builder_state);
    }

    /* Get LwHTTP Request Data */
    xStatusHTTP = lwhttp_request_get(req_ptr, &temp_buf_data, &temp_buf_data_len);
    if (pdTRUE != xStatusHTTP)
    {
      DBG_LWIP("Failed to get request! (status = %d)\r\n", xStatusHTTP);
    }
    else
    {
      DBG_LWIP("HTTP Request = %d bytes\r\n", temp_buf_data_len);
    }

    /* LwIP Connect TCP */
    conn = netconn_new(NETCONN_TCP);       
    if (NULL != conn)
    {
#if 0
      /* Bind a netconn to a specific local IP address and port (optional) */
      err = netconn_bind(conn, &netif->ip_addr, 60);
      if (err != ERR_OK)
      {
        cli_printf("[LwIP] %s --> netconn_bind (ERR = %d)\r\n", err);
      }
      else
#endif
      {
        err  = netconn_gethostbyname(server, &remote_ip);
        if (ERR_OK == err)
        {
#if 0
          DBG_LWIP("HOST: %s (%s)\r\n", server, ip4addr_ntoa((const ip4_addr_t *)&remote_ip));
#endif      
          /* Connect to server */
          err = netconn_connect(conn, &remote_ip, 80); 
          if (ERR_OK == err)
          {
#if 0
            DBG_LWIP("netconn_connect: OK\r\n");
#endif
            /* Write data to server */
            err = netconn_write(conn, temp_buf_data, temp_buf_data_len, NETCONN_NOFLAG);
            if (ERR_OK == err)
            {
              // DBG_LWIP("netconn_write (%d bytes)\r\n",  temp_buf_data_len);
              // DBG_RTOS("xPortGetFreeHeapSize = %d\r\n", xPortGetFreeHeapSize());

              /* Get pointer to buffer where response data is stored */
              uint8_t state = NETCONN_FSM_START;
              int8_t nxt_rsp = 0;
              BaseType_t finished = pdFALSE;

              for(state = NETCONN_FSM_START; state < NETCONN_FSM_FINISHED;)
              {
                switch (state)
                {
                  case NETCONN_FSM_START:
                    {
                      err = netconn_recv(conn, &netbuf);
                      if (err != ERR_OK)
                      {
                        state = NETCONN_FSM_FINISHED;
                      }
                      else
                      {
                        state = NETCONN_FSM_GET_DATA;
                      }
                    }
                    break;
                  case NETCONN_FSM_GET_DATA:
                    {
                      /* Get pointer to data and length*/
                      netbuf_data(netbuf, (void**)&temp_buf_data, &temp_buf_data_len);
                      
                      /* LwHTTP write response to parser */
                      if(pdPASS != lwhttp_response_put(rsp_ptr, (char*)temp_buf_data, temp_buf_data_len))
                      {
                        DBG_LWIP("HTTP Failed to put (len = %d)\r\n", temp_buf_data_len);
                      }

                      /* Try to get next part */
                      state = NETCONN_FSM_GET_NEXT;
                    }
                    break;
                  case NETCONN_FSM_GET_NEXT:
                    {
                      nxt_rsp = netbuf_next(netbuf);
                      if(nxt_rsp >= 0) {
                        state = NETCONN_FSM_GET_DATA; /* Continue */
                      }
                      else {
                        state = NETCONN_FSM_DELETE; /* No more parts */
                      }
                    }
                    break;
                  case NETCONN_FSM_DELETE:
                    {
                      netbuf_delete(netbuf);  
                      state = NETCONN_FSM_START; 
                    }
                  default:
                  break;
                }

                /* Debug if there is an error */
                if ((ERR_OK != err) && (err != ERR_CLSD))
                {
                  DBG_LWIP("NETCONN FSM: state (%d), err (%d)\r\n", state, err, finished);
                }
              }

              if (NETCONN_FSM_FINISHED == state)
              {
                /* Mark response as finished */
                lwhttp_response_put(rsp_ptr, NULL, 0);                      
              }
              
              if ((ERR_OK == err) || (err == ERR_CLSD))
              {
                DBG_LWIP("HTTP Response = %d bytes\r\n",  rsp_ptr->buffer.len);

                if ((rsp_ptr->buffer.data != NULL) 
                  && (rsp_ptr->buffer.len > 0)
                  && (rsp_ptr->builder_state == LwHHTP_BUILDER_FINISHED))
                {
                  xStatus = pdTRUE;               
                }
                else
                {
                  DBG_LWIP("xRet = %d, pState = %d, bState = %d\r\n", 
                    xStatus, 
                    rsp_ptr->parser_state, 
                    rsp_ptr->builder_state
                  );

                  DBG_LWIP("rsp_ptr->buffer .len = %d, .data = %ld\r\n", 
                    rsp_ptr->buffer.len,
                    (uint32_t)rsp_ptr->buffer.data
                  );

                  xStatus = pdFALSE;               
                }
              }
              else
              {
                DBG_LWIP("netconn_recv (err = %d)\r\n", err);
              }
            }
            else
            {
              DBG_LWIP("netconn_write (err = %d)\r\n", err);
            }
          }
          else
          {
            DBG_LWIP("netconn_connect (err = %d)\r\n", err);
          }
        }
        else
        {
          DBG_LWIP("netconn_gethostbyname (err = %d)\r\n", err);
        }
      }
      
      err = netconn_delete(conn);
      if (err != ERR_OK)
      {
        DBG_LWIP("netconn_delete (err = %d)\r\n", err);
      }
    }
    else
    {
      err = ERR_CONN;
      DBG_LWIP("netconn_new (err = %d)\r\n", err);
    }    
  }
  else
  {
    DBG_DHCP("Unable to send TCP (DHCP State = %d)\r\n", DHCP_state);
  }

  return xStatus;
}

#if (CLI_USE_FREERTOS_QUEUE == 1)
void Start_CLI_Logger_Task(void const * argument)
{
  /* USER CODE BEGIN Start_CLI_Logger_Task */
  char * pcReceivedString = NULL;

