argandas/STM32F746G-DISCO_TouchGFX_Demo-1/Core/Src/main.cpp
          /* Close & Delete connection */
          netconn_close(newconn);
          netconn_delete(newconn);
        
          /* Print HTTP Request */
          lwhttp_request_get_request_line(&server_request, &temp_buf_data, &temp_buf_data_len);
          cli_printf("[LwHTTP] Request-Line: %.*s\r\n", temp_buf_data_len, temp_buf_data);
          
          /* Print HTTP Response */
          lwhttp_response_parse(&server_response);
          lwhttp_response_get_status_line(&server_response, &temp_buf_data, &temp_buf_data_len);
          cli_printf("[LwHTTP] Status-Line: %.*s\r\n\r\n", temp_buf_data_len, temp_buf_data);
            
          /* Free LwHTTP Request & Response */
          lwhttp_request_free(&server_request);
          lwhttp_response_free(&server_response);
        }
        
        osDelay(10);
      }
    }
  }

  /* USER CODE END Start_HTTP_Server_Task */
}

/* USER CODE END 4 */

/* USER CODE BEGIN Header_StartDefaultTask */
/**
  * @brief  Function implementing the defaultTask thread.
  * @param  argument: Not used
  * @retval None
  */
/* USER CODE END Header_StartDefaultTask */
void StartDefaultTask(void const * argument)
{
  RTOS_TASK_START();  

  /* Graphic application */  
  GRAPHICS_MainTask();
      
  /* USER CODE BEGIN 5 */

  RTOS_TASK_READY();

  /* Infinite loop */
  for (;;)
  {
      osDelay(10);
  }
  /* USER CODE END 5 */ 
}

/* USER CODE BEGIN Header_StartButtonTask */
/**
* @brief Function implementing the buttonTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartButtonTask */
void StartButtonTask(void const * argument)
{
  RTOS_TASK_START();  

  /* USER CODE BEGIN StartButtonTask */
  uint32_t buttonState = 0;
  uint8_t buttonCount = 0;
  
  BSP_PB_Init(BUTTON_KEY, BUTTON_MODE_GPIO);
  
  RTOS_TASK_READY();
  /* Infinite loop */
  for(;;)
  {
    buttonState = BSP_PB_GetState(BUTTON_KEY);
    if (buttonState == 1)
    {
      if(xQueueSend(buttonQueueHandle, (uint8_t*)&buttonState, 0) == pdTRUE)
      {
        DBG_QUEUE("buttonQueueHandle: %d\r\n", buttonCount++);
      }
    }
    
    osDelay(10);
  }
  /* USER CODE END StartButtonTask */
}

/* USER CODE BEGIN Header_StartLEDTask */
/**
* @brief Function implementing the ledTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartLEDTask */
void StartLEDTask(void const * argument)
{
  RTOS_TASK_START();  

  /* USER CODE BEGIN StartLEDTask */
  uint8_t led_state = 0;

  BSP_LED_Init(LED_GREEN);
  BSP_LED_Off(LED_GREEN);  
      
  RTOS_TASK_READY();
  /* Infinite loop */
  for(;;)
  {
    if(xQueueReceive(ledQueueHandle, &led_state, 0) == pdTRUE)
    {
      DBG_QUEUE("ledQueueHandle: %d\r\n", led_state);
      if (led_state == 1)
      {
        BSP_LED_On(LED_GREEN);
      }
      else
      {
        BSP_LED_Off(LED_GREEN);
      }
    }

    osDelay(10);
  }
  /* USER CODE END StartLEDTask */
}

/* USER CODE BEGIN Header_StartSDTask */
/**
* @brief Function implementing the sdTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartSDTask */
void StartSDTask(void const * argument)
{
  RTOS_TASK_START();  

  /* USER CODE BEGIN StartSDTask */
  FRESULT fr;                                 /* FatFs function common result code */
  FATFS* fs = &SDFatFs;                       /* File system object for SD card logical drive */
  uint8_t ret = 0;
  uint32_t rng_value = 0;

  uint8_t state = 0;
  uint8_t state_new = 0;

  /* Queue PV */
  uint8_t queueData = 0;

  /* init code for FATFS */
  MX_FATFS_Init();

  RTOS_TASK_READY();

  /* Infinite loop */
  for(;;)
  {
    if (state != state_new)
    {
      DBG_FATFS("State transition (%d >> %d)\r\n", state, state_new);
      state = state_new;
    }

    switch(state){
      case 0:
      {
        /*##-1- Link the micro SD disk I/O driver ##################################*/
        ret = BSP_SD_Init();
        if(ret == MSD_OK)
        {
          /*##-2- Register the file system object to the FatFs module ##############*/
          fr = f_mount(fs, (TCHAR const*)SDPath, 0);
          if(fr != FR_OK)
          {
            DBG_FATFS("f_mount (fr = %d)\r\n",  fr);
          }
          else
          {
            // sd_cfg_set("api.thingspeak.com", "/update.json", "WTN6FH385TCUNDMU");
            sd_cfg_t xConfig;
            if (FR_OK == sd_cfg_get(&xConfig))
            {
              if (xConfig.api_key != NULL) DBG_FATFS("%s: %s\r\n", "api_key", xConfig.api_key);
              if (xConfig.server != NULL) DBG_FATFS("%s: %s\r\n", "server", xConfig.server);
              if (xConfig.url != NULL) DBG_FATFS("%s: %s\r\n", "url", xConfig.url);
            }

            state_new = 1;
          }
        }
        else
        {
          DBG_FATFS("BSP_SD_Init (ret = %d)\r\n",  ret);
        }
      }
      break;
      case 1:
      {
        /* Idle */
      }
      break;
      break;
      default:
      break;
    }

    if(xQueueReceive(logQueueHandle, &queueData, 0) == pdTRUE)
    {
      // DBG_QUEUE("logQueueHandle: %d\r\n", queueData);
#if 1      
      /* Get random number */
      HAL_RNG_GenerateRandomNumber(&hrng, &rng_value);

      /* Add to file */
      fr = sd_log((uint32_t)(rng_value % 40));
#else
      fr = sd_log((uint32_t)queueData);
#endif
      if(fr != FR_OK)
      {
        DBG_FATFS("sd_log failed = %d\r\n", fr);
        state_new = 0;
      }
    }
    else if(xQueueReceive(logDumpQueueHandle, &queueData, 0) == pdTRUE)
    {
      // DBG_QUEUE("logDumpQueueHandle\r\n");
      fr = sd_log_dump();
      if(fr != FR_OK)
      {
        DBG_FATFS("sd_log failed = %d\r\n", fr);
        state_new = 0;
      }
    }
    else if(xQueueReceive(logSentQueueHandle, &queueData, 0) == pdTRUE)
    {
      DBG_QUEUE("logSentQueueHandle\r\n");
      /* Get random number */
      sd_log_entry_t xEntry;

      if (FR_OK == sd_log_entry_get_pending(&xEntry))
      {
        if(FR_OK != sd_log_entry_set_sent(xEntry.ulID))
        {
          DBG_FATFS("sd_log_entry_set_sent failed = %d\r\n", fr);
          state_new = 0;
        }
      }

